## SQL Practices

In [1]:
# Load Magic commands
import sqlite3
%load_ext sql

# Load SQLite database
%sql sqlite:///pandp.db

In [2]:
%%sql
SELECT name tables
FROM sqlite_master 
WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' 
ORDER BY 1;

 * sqlite:///pandp.db
Done.

[('accounts',), ('orders',), ('region',), ('sales_reps',), ('web_events',)]

### order by

In [3]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24)]

In [4]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC, account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

### where

In [5]:
%%sql
SELECT *
FROM orders
WHERE account_id = 4251
ORDER BY occurred_at
LIMIT 1000;

 * sqlite:///pandp.db
Done.

[(6719, 4251, '2016-06-05 01:16:37', 0, 78, 0, 78, 0, 584.22, 0, 584.22),
 (4009, 4251, '2016-06-05 01:36:42', 626, 15, 0, 641, 3123.74, 112.35, 0, 3236.09),
 (4010, 4251, '2016-07-04 12:34:49', 498, 6, 2, 506, 2485.02, 44.94, 16.24, 2546.2),
 (4011, 4251, '2016-08-02 00:53:28', 679, 36, 5, 720, 3388.21, 269.64, 40.6, 3698.45),
 (6720, 4251, '2016-08-02 01:13:08', 9, 0, 19, 28, 44.91, 0, 154.28, 199.19),
 (4012, 4251, '2016-09-01 02:32:51', 503, 13, 32, 548, 2509.97, 97.37, 259.84, 2867.18),
 (6721, 4251, '2016-09-01 02:39:55', 3, 71, 50, 124, 14.97, 531.79, 406, 952.76),
 (4013, 4251, '2016-09-30 13:31:53', 503, 39, 0, 542, 2509.97, 292.11, 0, 2802.08),
 (4014, 4251, '2016-10-29 12:04:06', 483, 12, 0, 495, 2410.17, 89.88, 0, 2500.05),
 (6722, 4251, '2016-11-27 15:16:07', 19, 56, 0, 75, 94.81, 419.44, 0, 514.25),
 (4015, 4251, '2016-11-27 15:17:06', 520, 21, 7, 548, 2594.8, 157.29, 56.84, 2808.93),
 (6723, 4251, '2016-12-26 08:39:56', 0, 31, 21, 52, 0, 232.19, 170.52, 402.71),
 (4016, 4251, '2016-12-26 08:53:24', 521, 16, 28262, 28799, 2599.79, 119.84, 229487.44, 232207.07)]

In [6]:
%%sql
SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

In [7]:
%%sql
SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0, 0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0, 0, 0, 0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0, 0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0, 479.36, 0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0, 0, 16.24, 16.24)]

In [8]:
%%sql
SELECT *
FROM accounts
WHERE name = 'United Technologies'

 * sqlite:///pandp.db
Done.

[(1441, 'United Technologies', 'www.utc.com', 42.329397, -75.15785469, 'Janett Wisecarver', 321520)]

In [9]:
%%sql
SELECT *
FROM accounts
WHERE name != 'United Technologies'
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [10]:
%%sql
SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Mobil'

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

### Arthmetic

In [11]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty + poster_qty AS nonstandard_qty
FROM orders
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 123, 46),
 (1001, '2015-11-05 03:34:33', 190, 98),
 (1001, '2015-12-04 04:21:55', 85, 47),
 (1001, '2016-01-02 01:18:24', 144, 32),
 (1001, '2016-02-01 19:27:27', 108, 57)]

In [12]:
%%sql
SELECT id, account_id, standard_amt_usd/standard_qty AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 4.99),
 (2, 1001, 4.99),
 (3, 1001, 4.989999999999999),
 (4, 1001, 4.989999999999999),
 (5, 1001, 4.989999999999999),
 (6, 1001, 4.99),
 (7, 1001, 4.99),
 (8, 1001, 4.99),
 (9, 1001, 4.989999999999999),
 (10, 1001, 4.99)]

In [13]:
%%sql
SELECT id, account_id, 
poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 0.20019929527546923),
 (2, 1001, 0.269401582044551),
 (3, 1001, 0.0),
 (4, 1001, 0.0),
 (5, 1001, 0.23117672777557474),
 (6, 1001, 0.349983602717264),
 (7, 1001, 0.49862501668669074),
 (8, 1001, 0.5974661339050775),
 (9, 1001, 0.23737326760301367),
 (10, 1001, 0.07393917319249681)]

### like

In [14]:
%%sql
SELECT *
FROM accounts
WHERE website LIKE '%google%';

 * sqlite:///pandp.db
Done.

[(1351, 'Alphabet', 'www.google.com', 40.20427811, -75.07724145, 'Pamula Hammel', 321640)]

In [15]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE 'C%';

 * sqlite:///pandp.db
Done.

[('CVS Health',),
 ('Chevron',),
 ('Costco',),
 ('Cardinal Health',),
 ('Citigroup',),
 ('Comcast',),
 ('Cisco Systems',),
 ('Caterpillar',),
 ('Coca-Cola',),
 ('Cigna',),
 ('CHS',),
 ('ConocoPhillips',),
 ('Capital One Financial',),
 ('Centene',),
 ('Community Health Systems',),
 ('Cummins',),
 ('CenturyLink',),
 ('Colgate-Palmolive',),
 ('ConAgra Foods',),
 ('CarMax',),
 ('CBS',),
 ('C.H. Robinson Worldwide',),
 ('CDW',),
 ('Chesapeake Energy',),
 ('Consolidated Edison',),
 ('Cognizant Technology Solutions',),
 ('Computer Sciences',),
 ('CSX',),
 ('CBRE Group',),
 ('Charter Communications',),
 ('CST Brands',),
 ('Celgene',),
 ('Corning',),
 ('Core-Mark Holding',),
 ('Cameron International',),
 ('Crown Holdings',),
 ('Campbell Soup',)]

In [16]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%one%';

 * sqlite:///pandp.db
Done.

[('Honeywell International',),
 ('INTL FCStone',),
 ('Capital One Financial',),
 ('AutoZone',),
 ('Oneok',)]

In [17]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('Cisco Systems',)]

## In

In [18]:
%%sql
SELECT *
FROM orders
WHERE account_id IN (1001,1021)
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [19]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom');

 * sqlite:///pandp.db
Done.

[('Walmart', 'Tamara Tuma', 321500),
 ('Target', 'Luba Streett', 321660),
 ('Nordstrom', 'Yan Crater', 321820)]

### Not

In [20]:
%%sql
SELECT sales_rep_id, 
       name
FROM accounts
WHERE sales_rep_id NOT IN (321500,321570)
ORDER BY sales_rep_id
limit 5;

 * sqlite:///pandp.db
Done.

[(321510, 'Exxon Mobil'),
 (321510, 'J.P. Morgan Chase'),
 (321510, 'PepsiCo'),
 (321510, 'Energy Transfer Equity'),
 (321510, 'Delta Air Lines')]

In [21]:
%%sql
SELECT *
FROM accounts
WHERE website NOT LIKE '%com%';

 * sqlite:///pandp.db
Done.

[(1811, 'TIAA', 'www.tiaa.org', 42.3595683, -71.05133234, 'Deeanna Burpo', 321640),
 (2241, 'Community Health Systems', 'www.chs.net', 41.87567906, -87.63221831, 'Grazyna Dewald', 321710)]

In [22]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
limit 5;

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'Sung Shields', 321510),
 ('Apple', 'Jodee Lupo', 321520),
 ('Berkshire Hathaway', 'Serafina Banda', 321530),
 ('McKesson', 'Angeles Crusoe', 321540),
 ('UnitedHealth Group', 'Savanna Gayman', 321550)]

In [23]:
%%sql
SELECT *
FROM web_events
WHERE channel NOT IN ('organic', 'adwords')
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:13:58', 'direct'),
 (2, 1001, '2015-11-05 03:08:26', 'direct'),
 (3, 1001, '2015-12-04 03:57:24', 'direct'),
 (4, 1001, '2016-01-02 00:55:03', 'direct'),
 (5, 1001, '2016-02-01 19:02:33', 'direct')]

In [24]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

### AND & Between

In [25]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-04-01' AND occurred_at <= '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [26]:
%%sql
SELECT *
FROM orders
WHERE occurred_at BETWEEN '2016-04-01' AND '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [27]:
%%sql
SELECT *
FROM orders
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;

 * sqlite:///pandp.db
Done.

[(2613, 2951, '2016-08-15 00:06:12', 1171, 0, 0, 1171, 5843.29, 0, 0, 5843.29),
 (3260, 3491, '2014-08-29 22:43:00', 1552, 0, 0, 1552, 7744.48, 0, 0, 7744.48)]

In [28]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%' AND name LIKE '%s'
limit 4;

 * sqlite:///pandp.db
Done.

[('General Motors',), ('United Technologies',), ("Lowe's",), ('UPS',)]

In [29]:
%%sql
SELECT *
FROM web_events
WHERE channel IN ('organic', 'adwords') AND occurred_at BETWEEN '2016-01-01' AND '2017-01-01'
ORDER BY occurred_at DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(8493, 4141, '2016-12-31 16:31:23', 'organic'),
 (5661, 1851, '2016-12-31 06:55:38', 'organic'),
 (5562, 1791, '2016-12-31 02:08:50', 'adwords'),
 (7703, 3351, '2016-12-30 21:06:53', 'adwords'),
 (7921, 3521, '2016-12-30 20:15:48', 'organic')]

### or

In [30]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-12-04 04:21:55', 85, 47, 0),
 (1001, '2016-01-02 01:18:24', 144, 32, 0),
 (1001, '2016-07-30 03:26:30', 101, 36, 0),
 (1011, '2016-12-21 10:59:34', 527, 14, 0),
 (1021, '2015-10-12 02:21:56', 516, 23, 0)]

In [31]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE (standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0)
AND occurred_at = '2016-10-01'

 * sqlite:///pandp.db
Done.

[]

In [32]:
%%sql
SELECT id
FROM orders
WHERE gloss_qty > 4000 OR poster_qty > 4000
limit 5;

 * sqlite:///pandp.db
Done.

[(362,), (731,), (1191,), (1913,), (1939,)]

In [33]:
%%sql
SELECT *
FROM orders
WHERE standard_qty = 0 AND (gloss_qty > 1000 OR poster_qty > 1000);

 * sqlite:///pandp.db
Done.

[(1913, 2461, '2013-12-29 09:50:38', 0, 6450, 45, 6495, 0, 48310.5, 365.4, 48675.9),
 (4369, 1111, '2015-11-15 17:47:46', 0, 486, 2988, 3474, 0, 3640.14, 24262.56, 27902.7),
 (4391, 1161, '2016-06-04 08:58:10', 0, 106, 2967, 3073, 0, 793.94, 24092.04, 24885.98),
 (4420, 1191, '2016-05-21 23:21:14', 0, 43, 1448, 1491, 0, 322.07, 11757.76, 12079.83),
 (4448, 1231, '2016-06-25 12:27:15', 0, 3178, 23, 3201, 0, 23803.22, 186.76, 23989.98),
 (4698, 1451, '2015-02-26 06:13:21', 0, 484, 4901, 5385, 0, 3625.16, 39796.12, 43421.28),
 (4942, 1701, '2015-09-24 21:02:25', 0, 10744, 95, 10839, 0, 80472.56, 771.4, 81243.96),
 (5032, 1831, '2016-05-26 17:48:19', 0, 1448, 287, 1735, 0, 10845.52, 2330.44, 13175.96),
 (5191, 2051, '2015-05-17 14:17:59', 0, 1041, 0, 1041, 0, 7797.09, 0, 7797.09),
 (5791, 2861, '2014-10-24 12:06:22', 0, 10, 11691, 11701, 0, 74.9, 94930.92, 95005.82),
 (5805, 2861, '2016-09-29 04:51:11', 0, 60, 3122, 3182, 0, 449.4, 25350.64, 25800.04),
 (5895, 2931, '2016-01-18 09:21:18', 0, 519, 1315, 1834, 0, 3887.31, 10677.8, 14565.11),
 (5933, 3001, '2016-09-14 05:44:07', 0, 2802, 63, 2865, 0, 20986.98, 511.56, 21498.54),
 (6007, 3141, '2013-12-08 20:13:49', 0, 49, 1401, 1450, 0, 367.01, 11376.12, 11743.13),
 (6142, 3341, '2016-11-26 06:56:12', 0, 492, 1947, 2439, 0, 3685.08, 15809.64, 19494.72),
 (6285, 3491, '2015-02-22 09:54:25', 0, 1246, 0, 1246, 0, 9332.54, 0, 9332.54),
 (6332, 3571, '2016-09-18 15:30:41', 0, 51, 1752, 1803, 0, 381.99, 14226.24, 14608.23)]

In [34]:
%%sql
SELECT *
FROM accounts
WHERE (name LIKE 'C%' OR name LIKE 'W%') 
           AND ((primary_poc LIKE '%ana%' OR primary_poc LIKE '%Ana%') 
           AND primary_poc NOT LIKE '%eana%');

 * sqlite:///pandp.db
Done.

[(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560),
 (1361, 'Comcast', 'www.comcastcorporation.com', 42.54154764, -76.24992387, 'Shana Sanborn', 321650)]

### SQL Joins

In [35]:
%%sql
SELECT orders.*,
       accounts.*
FROM orders 
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [36]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [37]:
%%sql
SELECT accounts.name, orders.occurred_at
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart', '2015-10-06 17:31:14'),
 ('Walmart', '2015-11-05 03:34:33'),
 ('Walmart', '2015-12-04 04:21:55'),
 ('Walmart', '2016-01-02 01:18:24'),
 ('Walmart', '2016-02-01 19:27:27')]

In [38]:
%%sql
SELECT orders.standard_qty, orders.gloss_qty, 
 orders.poster_qty,  accounts.website, 
 accounts.primary_poc
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(123, 22, 24, 'www.walmart.com', 'Tamara Tuma'),
 (190, 41, 57, 'www.walmart.com', 'Tamara Tuma'),
 (85, 47, 0, 'www.walmart.com', 'Tamara Tuma'),
 (144, 32, 0, 'www.walmart.com', 'Tamara Tuma'),
 (108, 29, 28, 'www.walmart.com', 'Tamara Tuma')]

In [39]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

### Alias

In [40]:
%%sql
SELECT o.*, a.*
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [41]:
%%sql
SELECT a.primary_poc, w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE a.name = 'Walmart';

 * sqlite:///pandp.db
Done.

[('Tamara Tuma', '2015-10-06 04:22:11', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2015-10-06 17:13:58', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 05:02:47', 'organic', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 14:04:20', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 03:08:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 17:18:54', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-04 03:57:24', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-11 08:44:16', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-01 15:45:54', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-01-02 00:55:03', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-13 19:31:14', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-01 19:02:33', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-07 17:44:10', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-02-27 15:27:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-03-02 15:15:22', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-03-17 19:54:58', 'twitter', 'Walmart'),
 ('Tamara Tuma', '2016-04-01 10:58:55', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-04-05 03:02:52', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-04-17 16:41:02', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 14:26:40', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 15:26:44', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-07 02:28:31', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-05-21 16:22:01', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-31 20:53:47', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-06-02 04:41:31', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2016-06-22 13:48:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-06-30 12:09:45', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-12 22:43:02', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 11:29:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 21:08:52', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-30 03:06:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-08-12 09:31:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-08-28 06:42:42', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-01 18:33:56', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-11 17:06:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-09-26 23:14:59', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-10-26 20:21:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-11-25 22:52:29', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-12-24 05:35:14', 'direct', 'Walmart')]

In [42]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
ORDER BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('Southeast', 'Moon Torian', 'AECOM'),
 ('Southeast', 'Calvin Ollison', 'AES'),
 ('Northeast', 'Elba Felder', 'AIG')]

In [43]:
%%sql
SELECT r.name region, a.name account, 
    o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.833423765599567),
 ('Northeast', 'Walmart', 5.879706082872509),
 ('Northeast', 'Walmart', 5.646522151667762),
 ('Northeast', 'Walmart', 5.935815147625161),
 ('Northeast', 'Walmart', 6.0194924371875205)]

### left & Right Joins

In [44]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [45]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
LEFT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [46]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
RIGHT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

### Joins & Filtering

In [50]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
WHERE accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [51]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
AND accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [53]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 5.965174820318739),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 6.1687185711808565)]

In [54]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'State Farm Insurance Cos.', 5.119282250254291),
 ('Southeast', 'DISH Network', 5.231815847540363),
 ('Northeast', 'Travelers Cos.', 5.2351813313106526),
 ('Northeast', 'Best Buy', 5.260426437930026),
 ('West', 'Stanley Black & Decker', 5.266395560073999)]

In [55]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price DESC
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'IBM', 8.089906082278144),
 ('West', 'Mosaic', 8.066329210358129),
 ('West', 'Pacific Life', 8.063022652514793),
 ('Northeast', 'CHS', 8.018849326780114),
 ('West', 'Fidelity National Financial', 7.9928024668468325)]

In [56]:
%%sql
SELECT DISTINCT a.name, w.channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.id = '1001';

 * sqlite:///pandp.db
Done.

[('Walmart', 'adwords'),
 ('Walmart', 'banner'),
 ('Walmart', 'direct'),
 ('Walmart', 'facebook'),
 ('Walmart', 'organic'),
 ('Walmart', 'twitter')]

In [64]:
%%sql
SELECT o.occurred_at, a.name, o.total, o.total_amt_usd
FROM accounts a
JOIN orders o
ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '01-01-2015' AND '01-01-2016'
ORDER BY o.occurred_at DESC;

 * sqlite:///pandp.db
Done.

[]

## Agregate functions

In [65]:
%%sql
SELECT *
FROM accounts
WHERE id > 1500 and id < 1600

 * sqlite:///pandp.db
Done.

[(1501, 'Intel', 'www.intel.com', 41.03153857, -74.66846407, 'Elouise Beyers', 321580),
 (1511, 'Humana', 'www.humana.com', 41.43233665, -77.00496342, 'Bettye Close', 321590),
 (1521, 'Disney', 'www.disney.com', 41.87879976, -74.81102607, 'Timika Mistretta', 321600),
 (1531, 'Cisco Systems', 'www.cisco.com', 41.20101093, -76.53824668, 'Deadra Waggener', 321610),
 (1541, 'Pfizer', 'www.pfizer.com', 40.69325986, -75.79453197, 'Olevia Taubman', 321620),
 (1551, 'Dow Chemical', 'www.dow.com', 40.53050671, -74.66656358, 'Lillia Ogden', 321630),
 (1561, 'Sysco', 'www.sysco.com', 40.76252413, -73.97753022, 'Julia Laracuente', 321640),
 (1571, 'FedEx', 'www.fedex.com', 40.75290524, -73.97519248, 'Keren Mcconn', 321650),
 (1581, 'Caterpillar', 'www.caterpillar.com', 40.74789383, -73.97738651, 'Latia Beene', 321660),
 (1591, 'Lockheed Martin', 'www.lockheedmartin.com', 40.75497089, -73.98233134, 'Jared Aikins', 321670)]

In [66]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc = NULL

 * sqlite:///pandp.db
Done.

[]

In [68]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NOT NULL
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [69]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL

 * sqlite:///pandp.db
Done.

[]

### count

In [70]:
%%sql
SELECT COUNT(*)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]

In [71]:
%%sql
SELECT COUNT(accounts.id)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]